# ProfileNotPlanar Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RevolutionFailures..::..ProfileNotPlanar Property
BuiltInFailures..::..RevolutionFailures Class See Also
---
The Profile must lie in a plane.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ProfileNotPlanar { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ProfileNotPlanar As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ProfileNotPlanar {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RevolutionFailures Class
Autodesk.Revit.DB Namespace